[
  {
    "title": "Blood and bravado: the Trump shooting upended an election and shook the US",
    "description": "A year ago the image of Trump’s raised fist became a political touchstone, helping force Joe Biden from the race and fuelling a presidency like no other",
    "content": "Blake Marnell was standing in the front row, about 10 yards from Donald Trump, when the shots rang out. He watched the Secret Service pile on the former US president. “I was able to see him standing and I could see the blood on his ear,” Marnell reca... [10320 chars]",
    "url": "https://www.theguardian.com/us-news/2025/jul/13/trump-assassination-attempt-shooting",
    "image": "https://i.guim.co.uk/img/media/47cfa3eb6b220f96716b07ddc2f27226aa0b8f34/196_0_3156_2524/master/3156.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c23feede0621dfb5d596cad956eefaf",
    "publishedAt": "2025-07-13T10:00:00Z",
    "source": {
      "name": "The Guardian",
      "url": "https://www.theguardian.com"
    }
  },
  {
    "title": "Measles: Child dies at Alder Hey Children's hospital as cases surge",
    "description": "Seventeen children have been treated at the Liverpool hospital for the virus since June.",
    "content": "A child has died at Liverpool's Alder Hey Children's Hospital after contracting measles, the BBC understands.\nThe hospital said the highly contagious virus was on the rise among young people in the region and it had seen a surge in \"seriously unwell\"... [308 chars]",
    "url": "https://www.bbc.co.uk/news/articles/c8j1k3k44e2o",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/53b2/live/6ba4c850-5fc6-11f0-8755-2f8b5e5e47a7.jpg",
    "publishedAt": "2025-07-13T09:19:00Z",
    "source": {
      "name": "BBC",
      "url": "https://www.bbc.co.uk"
    }
  },
  {
    "title": "Child dies at Alder Hey Children's hospital as measles cases surge",
    "description": "It is thought 17 children have been treated at the Liverpool hospital for the virus since June.",
    "content": "Child dies at Alder Hey as measles cases surge\n23 minutes ago Share Save Stewart Whittingham BBC News, Liverpool Share Save\nGetty Images It is thought 17 children have been treated at Alder Hey for the disease since June\nA child has died at Liverpool... [2753 chars]",
    "url": "https://www.bbc.com/news/articles/c8j1k3k44e2o",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53b2/live/6ba4c850-5fc6-11f0-8755-2f8b5e5e47a7.jpg",
    "publishedAt": "2025-07-13T09:19:00Z",
    "source": {
      "name": "BBC",
      "url": "https://www.bbc.com"
    }
  },
  {
    "title": "Children fetching water killed in Israeli strike in Gaza, emergency officials say",
    "description": "The Israeli military has not yet commented on the strike, which witnesses said hit a crowd queuing to get water at a refugee camp.",
    "content": "Unverified footage shared online after the strike showed bloodied children and lifeless bodies, with screams of panic and desperation.\nResidents rushed to the scene and transported the wounded using private vehicles and donkey carts.\nThe strike came ... [2451 chars]",
    "url": "https://www.bbc.co.uk/news/articles/c0rvxjnvv71o",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2eb7/live/a02a6500-5fce-11f0-8a86-378d494e3c54.jpg",
    "publishedAt": "2025-07-13T09:02:28Z",
    "source": {
      "name": "BBC",
      "url": "https://www.bbc.co.uk"
    }
  },
  {
    "title": "UK measles cases rising among children - with leading NHS hospital 'concerned'",
    "description": "Alder Hey Children's Hospital in Liverpool said it has treated nearly 20 cases of measles since June, and put the increase partly down to a decline in people getting vaccinated.",
    "content": "A leading NHS hospital has warned measles is on the rise among children in the UK, after treating 17 cases since June.\nAlder Hey Children's Hospital in Liverpool said it is \"concerned\" about the increasing number of children and young people who are ... [3875 chars]",
    "url": "https://news.sky.com/story/uk-measles-cases-rising-among-children-with-leading-nhs-hospital-concerned-13396026",
    "image": "https://e3.365dm.com/25/07/1600x900/skynews-istock-stock-file-little_6963811.jpg?20250713093029",
    "publishedAt": "2025-07-13T08:39:23Z",
    "source": {
      "name": "Sky News",
      "url": "https://news.sky.com"
    }
  }
]